In [46]:
pip install plotly

Requirement already satisfied: plotly in c:\users\erica\anaconda3\lib\site-packages (5.4.0)
Requirement already satisfied: six in c:\users\erica\anaconda3\lib\site-packages (from plotly) (1.15.0)
Requirement already satisfied: tenacity>=6.2.0 in c:\users\erica\anaconda3\lib\site-packages (from plotly) (8.0.1)
Note: you may need to restart the kernel to use updated packages.

In [47]:
import numpy as np
import pandas as pd 
import plotly.express as px
from sklearn.model_selection import train_test_split

In [48]:
raw_dataset = pd.read_csv('dataset.csv')

In [49]:
print(list(raw_dataset.columns))
colunas_relevantes = raw_dataset[['registrou_bo', 'sexo', 'tipo_assalto_id', 'Bicicleta', 'Bolsa ou Mochila', 'Carteira', 'Cartão de Crédito', 'Celular', 'Computador', 'DVD', 'Dinheiro', 'Documentos', 'Equipamento de Som', 'Estepe', 'MP4 ou Ipod', 'Móveis', 'Notebook', 'Outros', 'Relógio', 'Som', 'Tablet', 'Tv']]
colunas_relevantes.head()

['id', 'bairro', 'created_at', 'descricao', 'endereco', 'id.1', 'ip_address_origin', 'latitude', 'longitude', 'registrou_bo', 'sexo', 'tipo_assalto_id', 'titulo', 'uri', 'user_id', 'valor_prejuizo', 'Bicicleta', 'Bolsa ou Mochila', 'Carteira', 'Cartão de Crédito', 'Celular', 'Computador', 'DVD', 'Dinheiro', 'Documentos', 'Equipamento de Som', 'Estepe', 'MP4 ou Ipod', 'Móveis', 'Notebook', 'Outros', 'Relógio', 'Som', 'Tablet', 'Tv', 'time']

,registrou_bo,sexo,tipo_assalto_id,Bicicleta,Bolsa ou Mochila,Carteira,Cartão de Crédito,Celular,Computador,DVD,...,Equipamento de Som,Estepe,MP4 ou Ipod,Móveis,Notebook,Outros,Relógio,Som,Tablet,Tv
0,True,0,6,NaN,True,True,NaN,True,NaN,True,...,True,NaN,True,NaN,True,NaN,NaN,True,True,True
1,True,1,1,NaN,NaN,NaN,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,True,NaN,NaN,NaN,NaN
2,True,1,1,NaN,NaN,NaN,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,True,NaN,NaN,NaN,NaN
3,True,0,5,NaN,True,True,True,True,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
4,True,1,1,NaN,True,True,True,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,True,True,NaN,NaN,NaN,NaN

In [50]:
# Limpar se registrou o BO
dataset_limpo = colunas_relevantes.loc[(colunas_relevantes['registrou_bo'] == True) | (colunas_relevantes['registrou_bo'] == False)]
# Limpar sexo
dataset_limpo = dataset_limpo.loc[dataset_limpo['sexo'] >= 0]
# Limpar ID tipo de assalto
dataset_limpo = dataset_limpo.loc[dataset_limpo['tipo_assalto_id'] >= 0]

dataset_limpo = dataset_limpo.fillna(False)
dataset_limpo
nulo = dataset_limpo.isnull().sum()

In [51]:
print(nulo) #Confirmando se está limpo

registrou_bo          0
sexo                  0
tipo_assalto_id       0
Bicicleta             0
Bolsa ou Mochila      0
Carteira              0
Cartão de Crédito     0
Celular               0
Computador            0
DVD                   0
Dinheiro              0
Documentos            0
Equipamento de Som    0
Estepe                0
MP4 ou Ipod           0
Móveis                0
Notebook              0
Outros                0
Relógio               0
Som                   0
Tablet                0
Tv                    0
dtype: int64

In [52]:
#separando variáveis para tabela crusada
registrou_bo = dataset_limpo['registrou_bo'] 
sexo = dataset_limpo['sexo']

In [53]:
pd.crosstab(registrou_bo, sexo,normalize = 'columns')

sexo                 0         1
registrou_bo
False         0.405749  0.407579
True          0.594251  0.592421

In [54]:
lista_var = list(dataset_limpo.columns)
lista_var.remove('registrou_bo')
lista_var.remove('sexo')
lista_var.remove('tipo_assalto_id')

lista_var

['Bicicleta',
 'Bolsa ou Mochila',
 'Carteira',
 'Cartão de Crédito',
 'Celular',
 'Computador',
 'DVD',
 'Dinheiro',
 'Documentos',
 'Equipamento de Som',
 'Estepe',
 'MP4 ou Ipod',
 'Móveis',
 'Notebook',
 'Outros',
 'Relógio',
 'Som',
 'Tablet',
 'Tv']

In [55]:
for var in lista_var:
    dataitens = pd.crosstab(registrou_bo, dataset_limpo[var],normalize = 'columns')
    dataitens.pop(False)
    display(dataitens)

Bicicleta         True
registrou_bo
False         0.491736
True          0.508264

Bolsa ou Mochila      True
registrou_bo
False             0.254582
True              0.745418

Carteira          True
registrou_bo
False         0.269868
True          0.730132

Cartão de Crédito      True
registrou_bo
False              0.158948
True               0.841052

Celular           True
registrou_bo
False         0.373565
True          0.626435

Computador    True
registrou_bo
False         0.23
True          0.77

DVD               True
registrou_bo
False         0.244186
True          0.755814

Dinheiro          True
registrou_bo
False         0.270429
True          0.729571

Documentos        True
registrou_bo
False         0.175577
True          0.824423

Equipamento de Som      True
registrou_bo
False               0.621739
True                0.378261

Estepe            True
registrou_bo
False         0.637874
True          0.362126

MP4 ou Ipod      True
registrou_bo
False         0.29771
True          0.70229

Móveis            True
registrou_bo
False         0.365854
True          0.634146

Notebook         True
registrou_bo
False         0.19837
True          0.80163

Outros            True
registrou_bo
False         0.341381
True          0.658619

Relógio           True
registrou_bo
False         0.310506
True          0.689494

Som           True
registrou_bo
False         0.28
True          0.72

Tablet            True
registrou_bo
False         0.256351
True          0.743649

Tv                True
registrou_bo
False         0.222892
True          0.777108

In [56]:
df = dataset_limpo[['registrou_bo', 'Bicicleta', 'Bolsa ou Mochila', 'Carteira', 'Cartão de Crédito', 'Celular', 'Computador', 'DVD', 'Dinheiro', 'Documentos', 'Equipamento de Som', 'Estepe', 'MP4 ou Ipod', 'Móveis', 'Notebook', 'Outros', 'Relógio', 'Som', 'Tablet', 'Tv']]
X_train, X_test, y_train, y_test = train_test_split(df.iloc[:,1:], df['registrou_bo'], test_size=0.2, random_state=0)

Estes são todos os imports necessários para a criação do modelo com a biblioteca Sklearn

In [61]:
from sklearn.tree import DecisionTreeClassifier
from sklearn.model_selection import cross_val_score
from sklearn.metrics import classification_report

from sklearn.ensemble import RandomForestClassifier

In [58]:

classificador = DecisionTreeClassifier(random_state=0)
classificador.fit(X_train,y_train)
classificador.score(X_test,y_test)

0.616969696969697

In [59]:
targets = ['Reportou', 'Não Reportou']
print(classification_report(y_test,classificador.predict(X_test),target_names = targets))

              precision    recall  f1-score   support

    Reportou       0.56      0.44      0.49      1046
Não Reportou       0.64      0.75      0.69      1429

    accuracy                           0.62      2475
   macro avg       0.60      0.59      0.59      2475
weighted avg       0.61      0.62      0.61      2475